Revit 2015 API
RevisionSettings.RevisionAlphabet Property
 Determines the sequence of characters assigned to revisions that use alphabetic numbering.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2015
Syntax
C#
public string RevisionAlphabet { get; set; }
Visual Basic
Public Property RevisionAlphabet As String
	Get
	Set
Visual C++
public:
property String^ RevisionAlphabet {
	String^ get ();
	void set (String^ value);
}
Remarks
 Individual revisions may be set to use alphabetic numbering rather than numeric. This property determines the characters assigned to the alphabetic revisions. The characters in this string will be assigned to revisions in the same order that they appear in the string. If there are more alphabetic revisions than characters in this string then subsequent alphabetic revisions will be assigned duplicated characters. For example, if the string provided were "XY", the first alphabetic revision would be shown as "X", the second as "Y", the third as "XX", then "YY", "XXX", etc.
 This string may not contain any whitespace, numeric characters, or duplicated characters. It also may not be empty.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: alphabet is an empty string. -or- When setting this property: alphabet contains one or more numeric characters. -or- When setting this property: alphabet contains one or more whitespace characters. -or- When setting this property: alphabet contains one or more duplicated characters.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was NULL
See Also
RevisionSettings Class
Autodesk.Revit.DB Namespace